; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	spectrograph5 - mode
	spectrograph4 - mode
	infrared1 - mode
	thermograph2 - mode
	thermograph3 - mode
	infrared0 - mode
	Star4 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star5 - direction
	Star3 - direction
	GroundStation2 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star5)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star5)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument4 infrared0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 spectrograph4)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 Star5)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star10)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star5)
	(supports instrument8 spectrograph4)
	(supports instrument8 infrared1)
	(supports instrument8 thermograph3)
	(supports instrument8 spectrograph5)
	(calibration_target instrument8 GroundStation1)
	(supports instrument9 infrared0)
	(supports instrument9 infrared1)
	(calibration_target instrument9 GroundStation2)
	(calibration_target instrument9 Star5)
	(supports instrument10 spectrograph4)
	(calibration_target instrument10 GroundStation2)
	(calibration_target instrument10 Star3)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star10)
)
(:goal (and
	(pointing satellite3 Star10)
	(have_image Star6 thermograph3)
	(have_image Star6 thermograph2)
	(have_image Planet7 spectrograph4)
	(have_image Star8 infrared0)
	(have_image Planet9 infrared0)
	(have_image Planet9 spectrograph4)
	(have_image Star10 spectrograph5)
	(have_image Star10 infrared1)
	(have_image Star11 infrared0)
	(have_image Phenomenon12 spectrograph4)
))

)

; plan
1. (turn_to satellite5 groundstation1 star10)
   deleted: (pointing satellite5 star10)
   added: (pointing satellite5 groundstation1)
   goals met: 1 of 11
2. (switch_on instrument8 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument8)
   goals met: 1 of 11
3. (calibrate satellite5 instrument8 groundstation1)
   added: (calibrated instrument8)
   goals met: 1 of 11
4. (turn_to satellite5 star10 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 star10)
   goals met: 1 of 11
5. (take_image satellite5 star10 instrument8 spectrograph5)
   added: (have_image star10 spectrograph5)
   goals met: 2 of 11
6. (take_image satellite5 star10 instrument8 infrared1)
   added: (have_image star10 infrared1)
   goals met: 3 of 11
7. (turn_to satellite5 planet7 star10)
   deleted: (pointing satellite5 star10)
   added: (pointing satellite5 planet7)
   goals met: 3 of 11
8. (take_image satellite5 planet7 instrument8 spectrograph4)
   added: (have_image planet7 spectrograph4)
   goals met: 4 of 11
9. (turn_to satellite5 phenomenon12 planet7)
   deleted: (pointing satellite5 planet7)
   added: (pointing satellite5 phenomenon12)
   goals met: 4 of 11
10. (turn_to satellite1 star5 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star5)
   goals met: 4 of 11
11. (take_image satellite5 phenomenon12 instrument8 spectrograph4)
   added: (have_image phenomenon12 spectrograph4)
   goals met: 5 of 11
12. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 5 of 11
13. (calibrate satellite1 instrument2 star5)
   added: (calibrated instrument2)
   goals met: 5 of 11
14. (turn_to satellite1 planet9 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet9)
   goals met: 5 of 11
15. (take_image satellite1 planet9 instrument2 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 6 of 11
16. (turn_to satellite1 star11 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star11)
   goals met: 6 of 11
17. (take_image satellite1 star11 instrument2 infrared0)
   added: (have_image star11 infrared0)
   goals met: 7 of 11
18. (turn_to satellite1 star6 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star6)
   goals met: 7 of 11
19. (take_image satellite1 star6 instrument2 thermograph2)
   added: (have_image star6 thermograph2)
   goals met: 8 of 11
20. (turn_to satellite1 star8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star8)
   goals met: 8 of 11
21. (take_image satellite1 star8 instrument2 infrared0)
   added: (have_image star8 infrared0)
   goals met: 9 of 11
22. (turn_to satellite5 planet9 phenomenon12)
   deleted: (pointing satellite5 phenomenon12)
   added: (pointing satellite5 planet9)
   goals met: 9 of 11
23. (take_image satellite5 planet9 instrument8 spectrograph4)
   added: (have_image planet9 spectrograph4)
   goals met: 10 of 11
24. (turn_to satellite5 star6 planet9)
   deleted: (pointing satellite5 planet9)
   added: (pointing satellite5 star6)
   goals met: 10 of 11
25. (take_image satellite5 star6 instrument8 thermograph3)
   added: (have_image star6 thermograph3)
   goals met: 11 of 11
